app/controllers/index_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "tokens" WHERE (user_id is NOT NULL) ORDER BY updated_at DESC
---
  def top
    @recent_logins = User.find(:all, :order => "updated_at DESC")
    @available_tokens = Token.find(:all, :conditions => ["user_id is NULL", ], :order => "updated_at DESC")

SELECT * FROM "tokens" WHERE ("tokens"."token" = '3n3hi') LIMIT 1
UPDATE "tokens" SET "updated_at" = '2010-04-18 12:53:28', "user_id" = 2 WHERE "id" = 16
---
  def downloader
    @token = Token.find_by_token(params["token"]["token"])
    if @token
      if current_user
        unless @token.user
          @token.user_id = current_user.id
          @token.save

SELECT * FROM "tokens" WHERE ("tokens"."token" = '3n3hi') LIMIT 1
---
  def fetch
    filename = params["mp3"]
    if current_user.token
      token = current_user.token.token
      @token = Token.find_by_token(token)

SELECT * FROM "users" WHERE ("users"."login" = 'hackreal') LIMIT 1
---
  def user
    @user = User.find_by_login(params["login"])